In [48]:
import pandas as pd

df = pd.read_csv('../Apple462.csv')
df = df.drop(df[df["region"] != "UK"].index)
df = df.drop(columns=["Unnamed: 0"])
df

            Date   Envi   Fuji   Gala region
156   27/12/2015  30482   2972   5894     UK
157   20/12/2015  25628   2546   7394     UK
158   13/12/2015  27149   2986   6458     UK
159    6/12/2015  35591  12527   4086     UK
160   29/11/2015  24190   2790   6031     UK
...          ...    ...    ...    ...    ...
3340    4/2/2018          8511  22490     UK
3341   28/1/2018  66654   1972   6962     UK
3342   21/1/2018  49711   2157   6343     UK
3343   14/1/2018  49335   7415   8299     UK
3344    7/1/2018  45937   2658   7511     UK

[169 rows x 5 columns]

In [49]:
df_fuji = df.drop(columns=["Envi", "Gala", "region"])
df_fuji.head(10)

           Date   Fuji
156  27/12/2015   2972
157  20/12/2015   2546
158  13/12/2015   2986
159   6/12/2015  12527
160  29/11/2015   2790
161  22/11/2015   3256
162  15/11/2015  12086
163   8/11/2015   4652
164   1/11/2015   4360
165  25/10/2015  10090

In [50]:
df_fuji["Date"] = pd.to_datetime(df_fuji["Date"], format="%d/%m/%Y")
df_fuji.info()

<class 'pandas.core.frame.DataFrame'>
Index: 169 entries, 156 to 3344
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    169 non-null    datetime64[ns]
 1   Fuji    169 non-null    object
dtypes: datetime64[ns](1), object(1)
memory usage: 4.0+ KB

In [51]:
df_fuji.sort_values(by="Date", inplace=True)
df_fuji["Date"] = df_fuji["Date"].dt.strftime("%d/%m/%Y")
df_fuji.head(10)

           Date   Fuji
207  04/01/2015  24964
206  11/01/2015  10998
205  18/01/2015   6342
204  25/01/2015   7556
203  01/02/2015  36532
202  08/02/2015   9647
201  15/02/2015   7840
200  22/02/2015  16375
199  01/03/2015  23739
198  08/03/2015   7206

In [52]:
result = df_fuji[df_fuji['Fuji'] == ' ']
result

            Date Fuji
1257  23/10/2016

In [53]:
df_fuji.to_csv("fuji.csv", sep=",", encoding="utf-8", index=False)